/*	JAVASCRIPT DOCUMENT
*	UTF-8
*/

/*  WebHMI client resources: TRG(P).
*
*   Copyright (C) 2019  ATgroup09 (atgroup09@gmail.com)
*
*   The JavaScript code in this page is free software: you can
*   redistribute it and/or modify it under the terms of the GNU
*   General Public License (GNU GPL) as published by the Free Software
*   Foundation, either version 3 of the License, or (at your option)
*   any later version.  The code is distributed WITHOUT ANY WARRANTY;
*   without even the implied warranty of MERCHANTABILITY or FITNESS
*   FOR A PARTICULAR PURPOSE.  See the GNU GPL for more details.
*
*   As additional permission under GNU GPL version 3 section 7, you
*   may distribute non-source (e.g., minimized or compacted) forms of
*   that code without the copy of the GNU GPL normally required by
*   section 4, provided you include this license notice and a URL
*   through which recipients can access the Corresponding Source.
*/


/* Include:
*      + ../mod/hmi-v2-main.js
*/


//** GLOBAL VARIABLES

//Init
G_RES = { ru: {       SrvConnErr: "Ошибка! Нет подключения к серверу {0}!",
					   NoDataErr: "Ошибка! Нет данных длительное время! Проверьте связь с сервером {0}.",
			     WsNotSupportErr: "Ошибка! Ваш браузер не поддерживает работу с web-сокетами!",
						 Connect: "подключиться",
		              Disconnect: "отключиться",
		               WebSocket: "WebSocket",
					    WatchDog: "WatchDog",
					   Connected: "соединение установлено",
				    Disconnected: "соединение сброшено",
				   AutoReconnect: "попытка восстановления соединения...",
				      ConnStates: ["подключение...", "подключено", "отключение...", "отключено", "отключено"],
				            None: "---",
			            BitBgYel: {0:"background-color:#ffffff;", 1:"background-color:#ffff00;"},
						BitBgRed: {0:"background-color:#ffffff;", 1:"background-color:#ff0000;color:#ffffff;text-shadow:none;"},
						   NoYes: ["нет", "да"],
						  NoHave: ["нет", "есть"],
				            ClOp: ["закр", "откр"],
						 NormErr: ["норма", "ошибка"],
				             Trg: "ТРГ",
						     Reg: "Регулятор",
						    Mode: "Режим",
						    Type: "Тип",
						   Error: "Ошибка",
						 Warning: "Внимание",
				              Mo: ["", "ремонт", "неисправность", "блокировка"],
				           MoSrc: ["images/mode-m.png", "images/mode-a.png", "images/mode-d.png"],
						   Modes: ["ручной", "автомат", "наладчик"],
				           TySrc: ["images/mode-g.png", "images/mode-s.png"],
						   Types: ["газ", "пар"],
						  Stages: {0:"нет готовности", 1:"готовность запуска", 2:"пуск (инициализация)", 3:"пуск (продувка)", 4:"пуск (розжиг)", 5:"пуск (ожидание пламени)", 6:"пуск (стабилизация пламени)", 7:"пуск (прогрев)", 8:"регулирование", 9:"останов (гашение пламени)", 10:"останов (продувка)", 11:"останов (инициализация)", 12:"останов (регулирование)", 13:"авария (гашение пламени)", 14:"авария (продувка)", 15:"авария (инициализация)", 16:"авария", 17:"останов по кнопке (гашение пламени)", 18:"останов по кнопке (продувка)", 19:"останов по кнопке (инициализация)", 20:"останов по кнопке", 21:"конец программы (гашение пламени)", 22:"конец программы (продувка)", 23:"конец программы (инициализация)", 24:"конец программы", 25:"пуск (инициализация)", 26:"пуск (рециркуляция)"},
						    WsEr: {1:"Ошибки Модулей В/В", 2:"Ошибки ИМ", 4:"Ошибки Тех.процесса"},
						  WsErIO: {1:"связь с модулем AI01", 2:"связь с модулем DO01", 4:"каналы модуля AI01", 8:"связь с ATV312", 16:"ATV312", 32:"связь с ПВТ100"},
						  WsErEm: {1:"двигатель рециркуляции", 2:"газовая заслонка (настройки)", 4:"воздушная заслонка (настройки)", 8:"клапан п.5", 16:"клапан п.7", 32:"клапан п.6", 64:"датчик пламени", 128:"трансформатор зажигания (настройки)", 256:"КЗР подачи пара (настройки)", 512:"газовая заслонка (инициализация)", 1024:"воздушная заслонка (инициализация)", 2048:"КЗР подачи пара (инициализация)"},
						 WsErPro: {1:"давл. газа на входе вне зоны допуска", 2:"давл. газа горелки вне зоны допуска", 4:"разрежение вне зоны допуска", 8:"аварийная температура", 16:"нет пламени", 32:"инициализация", 64:"длительный выход на уставку", 2048:"некорректное значение 'Начать шаг с...'", 4096:"не задана длит. запуск. шага", 8192:"тип запуск. шага 'Конец программы'", 16384:"параметры тех.процесса не утверждены", 32768:"режим Ручной/Наладчик"},
						 WsWaPro: {1:"давл. газа на входе вне зоны допуска", 2:"давл. газа горелки вне зоны допуска", 4:"разрежение вне зоны допуска", 8:"аварийная температура", 16:"повысьте вручную давл. газа горелки (до мин.)", 32:"понизьте вручную давл. газа горелки (до мин.)", 64:"понизьте вручную давл. газа горелки (до макс.)", 128:"длительный выход на уставку", 32768:"повторный розжиг"},
					        WsSt: {1:"пуск", 2:"тех.процесс утвержден", 4:"инициализирован", 8:"закрытие газовой заслонки", 16:"открытие газовой заслонки", 32:"гашение пламени", 64:"розжиг", 512:"рециркуляция включена", 1024:"клапан п.5 открыт", 2048:"клапан п.7 открыт", 4096:"клапан п.6 закрыт", 16384:"искра", 32768:"пламя"},
						 WsStNot: {1:"стоп", 2:"тех.процесс сброшен", 512:"рециркуляция выключена", 1024:"клапан п.5 закрыт", 2048:"клапан п.7 закрыт", 4096:"клапан п.6 открыт"}
			  }
		};


